app/controllers/comments_controller.rb

	def create
    @festival = Festival.find(params[:festival_id])
    @comment = @festival.comments.create(comment_params)
---
SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("commenter", "body", "festival_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "John"], ["body", "Hey this was fun"], ["festival_id", 2], ["created_at", "2015-09-18 17:26:38.174620"], ["updated_at", "2015-09-18 17:26:38.174620"]]