app/controllers/festivals_controller.rb

SELECT "festivals".* FROM "festivals"
---
	def index
		@festivals = Festival.all

SELECT "festivals".* FROM "festivals"
SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@festivals = Festival.all
		@festival = Festival.find(params[:id])

INSERT INTO "festivals" ("name", "date", "location", "info", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
	def create
		@festival = Festival.new(festival_params)
		if @festival.save

SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT 1  [["id", 3]]
---
	def edit
		@festival = Festival.find(params[:id])

SELECT  "festivals".* FROM "festivals" WHERE "festivals"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "festivals" SET "image_updated_at" = $1, "image_file_name" = $2, "updated_at" = $3 WHERE "festivals"."id" = $4  [["image_updated_at", "2015-09-18 02:32:20.667438"], ["image_file_name", "Armin_van_Buuren_Ultra_Music_Festival_3840x2160.jpg"], ["updated_at", "2015-09-18 02:32:22.635791"], ["id", 1]]
---
	def update
		@festival = Festival.find(params[:id])
		if @festival.update_attributes(festival_params)

DELETE FROM "festivals" WHERE "festivals"."id" = $1  [["id", 3]]
---
	def destroy
		festival = Festival.find(params[:id])
		Comment.where({festival_id: festival.id }).destroy_all